/*
 * PrestaCart
 * @version  3.0
 *
 * @author Hashem Afkhami @ prestayar.com <hashem_afkhami@yahoo.com>
 * @copyright  2016 prestayar.com
 * 2016 prestayar.com
 *
 */
function cityList(index) {
    var cityOptions = [];
    var selectCity = document.getElementById('id_city');
    selectCity.options.length = 0;
    cityOptions[0] = ["--- شهر خود را انتخاب کنید ---", ""];
    if (index == 0) {}
    else if (index == 4) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آبادان", "631"],
            ["آبادان - اروندکنار", "6331"],
            ["آغاجاری", "6371"],
            ["امیدیه", "63731"],
            ["اندیمشک", "6481"],
            ["اهواز", "61"],
            ["ایذه", "6391"],
            ["باغ ملک - باغ ملک", "63951"],
            ["باغ ملک - صیدون", "63941"],
            ["باغ ملک - میداود", "63931"],
            ["بندرماهشهر", "6351"],
            ["بندرماهشهر - بندرامام خمینی", "63561"],
            ["بهبهان", "6361"],
            ["بهبهان - سردشت", "63681"],
            ["حمیدیه", "63441"],
            ["خرمشهر", "641"],
            ["خرمشهر - مینوشهر", "64371"],
            ["دزفول", "6461"],
            ["دشت آزادگان - بستان", "64481"],
            ["دشت آزادگان - سوسنگرد", "6441"],
            ["رامشیر", "63871"],
            ["رامهرمز", "6381"],
            ["شادگان", "6431"],
            ["شادگان - دارخوین", "64341"],
            ["شوش", "6471"],
            ["شوشتر", "6451"],
            ["گتوند", "64551"],
            ["گتوند - جنت مکان", "64541"],
            ["لالی", "64941"],
            ["مسجدسلیمان", "6491"],
            ["هفتگل", "64961"],
            ["هندیجان", "63591"],
            ["هویزه", "64451"]
        ]
    }
    else if (index == 5) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آباده", "7391"],
            ["آباده - ایزدخواست", "73991"],
            ["ارسنجان", "73761"],
            ["استهبان", "7451"],
            ["استهبان - رونیز ", "74461"],
            ["اقلید", "7381"],
            ["اقلید - حسن آباد-فارس", "73841"],
            ["اقلید - سده", "73861"],
            ["بوانات", "73941"],
            ["پاسارگاد - سعادت شهر", "73741"],
            ["جهرم", "741"],
            ["جهرم - خاوران", "74541"],
            ["خرامه", "73441"],
            ["خرم بید - صفاشهر", "73951"],
            ["خنج", "74431"],
            ["داراب - رستاق", "74841"],
            ["رستم - مصیری", "73571"],
            ["زرین دشت - حاجی آباد", "74861"],
            ["سپیدان-اردکان", "7361"],
            ["سروستان", "73451"],
            ["شیراز ", "71"],
            ["فارس- داراب", "7481"],
            ["فراشبند", "74771"],
            ["فسا", "7461"],
            ["فیروزآباد - فارس", "7471"],
            ["فیروزآباد - میمند", "74741"],
            ["قیروکارزین - کارزین", "74761"],
            ["کازرون", "731"],
            ["کازرون - انارستان", "73351"],
            ["کازرون - خشت", "73341"],
            ["کازرون - قائمیه", "7331"],
            ["کوار", "73461"],
            ["لارستان - کهنه", "74411"],
            ["لارستان - لار", "7431"],
            ["لامرد", "74341"],
            ["مرودشت", "7371"],
            ["مرودشت - کوشک", "73711"],
            ["ممسنی - نور آباد", "7351"],
            ["مهر - فارس", "74451"],
            ["نی ریز", "7491"]
        ]
    }
    else if (index == 27) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آبدانان", "6971"],
            ["ایلام", "6931"],
            ["ایوان", "6941"],
            ["بدره", "69671"],
            ["چرداول - سرآبله", "6951"],
            ["دره شهر", "6961"],
            ["دهلران", "6981"],
            ["مهران", "6991"]
        ]
    }
    else if (index == 8) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آبیک", "3441"],
            ["آوج", "3461"],
            ["آوج - آبگرم", "34641"],
            ["البرز - الوند", "3431"],
            ["البرز - بیدستان", "34151"],
            ["البرز - محمدیه", "3491"],
            ["بوئین زهرا", "3451"],
            ["بوئین زهرا - شال", "34571"],
            ["تاکستان", "3481"],
            ["تاکستان - اسفرورین", "34561"],
            ["تاکستان - خرمدشت", "34831"],
            ["تاکستان - ضیاءآباد", "34851"],
            ["قزوین", "341"],
            ["قزوین - اقبالیه", "34171"],
            ["قزوین - محمودآبادنمونه", "34131"],
            ["قزوین-کوهین", "34971"]
        ]
    }
    else if (index == 16) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آذربایجان غربی-سردشت", "5961"],
            ["ارومیه", "571"],
            ["اشنویه", "5771"],
            ["بوکان", "5951"],
            ["پلدشت", "58771"],
            ["پیرانشهر", "5781"],
            ["تکاب", "5991"],
            ["چایپاره - چورس", "58551"],
            ["خوی", "581"],
            ["خوی - فیرورق", "5841"],
            ["سردشت - ربط", "59691"],
            ["سلماس", "5881"],
            ["سلماس - تازه شهر", "5891"],
            ["شاهین دژ", "5981"],
            ["شوط", "58751"],
            ["ماکو", "5861"],
            ["ماکو - بازرگان", "58671"],
            ["مهاباد-آذربایجان غربی", "591"],
            ["میاندوآب", "5971"],
            ["نقده", "5761"]
        ]
    }
    else if (index == 3) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آذرشهر", "5371"],
            ["آذرشهر - گوگان", "53761"],
            ["اسکو", "5351"],
            ["اسکو - ایلخچی", "53581"],
            ["اسکو - شهرجدیدسهند", "5331"],
            ["اهر", "5451"],
            ["بستان آباد", "5491"],
            ["بناب", "5551"],
            ["تبریز", "51"],
            ["تبریز - باسمنج", "53661"],
            ["تبریز - خسرو شهر", "53551"],
            ["تبریز - سردرود", "5361"],
            ["جلفا", "5441"],
            ["جلفا - هادیشهر", "5431"],
            ["چاراویماق - قره آغاج", "5581"],
            ["سراب", "5471"],
            ["شبستر", "5381"],
            ["شبستر - تسوج", "53881"],
            ["شبستر - خامنه", "53841"],
            ["شبستر - شرفخانه", "53891"],
            ["شبستر - شند آباد", "53871"],
            ["شبستر - صوفیان", "53861"],
            ["عجب شیر", "5541"],
            ["کلیبر", "5461"],
            ["مراغه", "551"],
            ["مرند", "541"],
            ["مرند - بناب جدید", "54351"],
            ["مرند - یامچی", "54391"],
            ["ملکان", "5561"],
            ["ممقان", "53751"],
            ["میانه", "531"],
            ["میانه - قره بلاغ", "53381"],
            ["میانه - کندوان", "54685"],
            ["ورزقان", "54581"],
            ["هریس", "5391"],
            ["هشترود", "5571"]
        ]
    }
    else if (index == 6) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آران و بیدگل", "8741"],
            ["اردستان", "8381"],
            ["اردستان - زواره", "8441"],
            ["اردستان - مهاباد-اصفهان", "84431"],
            ["اصفهان", "81"],
            ["اصفهان - بهارستان", "81431"],
            ["اصفهان - خوراسگان", "81561"],
            ["اصفهان - سپاهان شهر", "81799"],
            ["اصفهان - هرند", "83741"],
            ["اصفهان- مبارکه", "8481"],
            ["اصفهان-برخوار-دولت آباد", "8341"],
            ["اصفهان-تیران وکرون - رضوانشهر", "85331"],
            ["اصفهان-فریدن - داران", "8561"],
            ["برخوار - خورزوق", "83451"],
            ["بوئین و میاندشت", "85651"],
            ["تیران وکرون - تیران", "8531"],
            ["چادگان", "8571"],
            ["خمینی شهر", "841"],
            ["خمینی شهر - درچه پیاز", "8431"],
            ["خوانسار", "8791"],
            ["خوانسار - رحمت اباد", "87941"],
            ["دهاقان", "8641"],
            ["سمیرم", "8661"],
            ["شاهین شهرومیمه", "831"],
            ["شاهین شهرومیمه - گز برخوار", "83441"],
            ["شاهین شهرومیمه - میمه-اصفهان", "8351"],
            ["شهرضا", "861"],
            ["فریدن - دامنه", "85641"],
            ["فریدونشهر", "8591"],
            ["فلاورجان", "8451"],
            ["فلاورجان - ابریشم", "81789"],
            ["فلاورجان - قهدریجان", "8461"],
            ["فلاورجان - کلیشادوسودرجان", "84561"],
            ["کاشان", "871"],
            ["گلپایگان", "8771"],
            ["لنجان - باغ بهادران", "84761"],
            ["لنجان - زاینده رود", "84931"],
            ["لنجان - زرین شهر", "8471"],
            ["لنجان - فولادشهر", "8491"],
            ["مبارکه - دهسرخ", "84861"],
            ["مبارکه - زیباشهر", "84841"],
            ["مبارکه - فولادمبارکه", "84881"],
            ["نائین", "8391"],
            ["نجف آباد", "851"],
            ["نجف آباد - گلدشت", "85831"],
            ["نطنز", "8761"],
            ["نطنز - بادرود", "87661"]
        ]
    }
    else if (index == 14) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آزاد شهر", "4961"],
            ["آق قلا", "4931"],
            ["بندرترکمن", "4891"],
            ["بندرگز", "4871"],
            ["رامیان", "4951"],
            ["علی آباد", "4941"],
            ["کردکوی", "4881"],
            ["کلاله", "4991"],
            ["گالیکش", "49831"],
            ["گرگان", "491"],
            ["گرگان - جلین", "49351"],
            ["گنبد کاووس", "4971"],
            ["مراوه تپه", "48733"],
            ["مینودشت", "4981"]
        ]
    }
    else if (index == 2) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آستارا", "4391"],
            ["آستانه اشرفیه", "4441"],
            ["املش", "44951"],
            ["بندرانزلی", "431"],
            ["رشت", "41"],
            ["رشت - خمام", "4341"],
            ["رودبار - رستم آباد", "44641"],
            ["رودبار - علی اباد-گیلان", "44631"],
            ["رودبار - لوشان", "44531"],
            ["رودبار - منجیل", "4451"],
            ["رودبار-گیلان", "4461"],
            ["رودسر", "4481"],
            ["رودسر - چابکسر", "44871"],
            ["رودسر - کلاچای", "4491"],
            ["سیاهکل", "4431"],
            ["شفت", "43541"],
            ["صومعه سرا", "4361"],
            ["طوالش - اسالم", "43891"],
            ["طوالش - لیسار", "43761"],
            ["طوالش - هشتپر", "4371"],
            ["فومن", "4351"],
            ["فومن - ماسوله", "43571"],
            ["گیلان - رضوانشهر", "43841"],
            ["لاهیجان", "441"],
            ["لنگرود", "4471"],
            ["ماسال", "4381"]
        ]
    }
    else if (index == 11) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آشتیان", "3961"],
            ["اراک", "381"],
            ["اراک - سنجان", "38481"],
            ["اراک - کرهرود", "3831"],
            ["تفرش", "3951"],
            ["خمین", "3881"],
            ["خنداب", "3841"],
            ["دلیجان", "3791"],
            ["زرندیه - مامونیه", "3941"],
            ["ساوه", "391"],
            ["شازند", "3861"],
            ["شازند - شهرجدیدمهاجران", "3991"],
            ["کمیجان", "3851"],
            ["کمیجان - میلاجرد", "38551"],
            ["محلات", "3781"]
        ]
    }
    else if (index == 13) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["آمل", "461"],
            ["بابل", "471"],
            ["بابلسر", "4741"],
            ["بهشهر", "4851"],
            ["تنکابن", "4681"],
            ["جویبار", "4771"],
            ["چالوس", "4661"],
            ["چالوس - مرزن آباد", "46641"],
            ["رامسر", "4691"],
            ["ساری", "481"],
            ["سوادکوه - پل سفید", "4791"],
            ["عباس آباد - سلمانشهر", "4671"],
            ["فریدونکنار", "4751"],
            ["قائم شهر", "4761"],
            ["کلاردشت", "46661"],
            ["گلوگاه-مازندران", "4861"],
            ["محمودآباد-مازندران", "4631"],
            ["نکا", "4841"],
            ["نور", "4641"],
            ["نور - ایزدشهر", "46411"],
            ["نور - بلده", "46471"],
            ["نوشهر", "4651"]
        ]
    }
    else if (index == 25) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["ابرکوه", "8931"],
            ["بافق", "8971"],
            ["تفت", "8991"],
            ["خاتم - هرات", "89881"],
            ["صدوق - اشکذر", "89416"],
            ["مهریز", "8981"],
            ["میبد", "8961"],
            ["یزد", "891"],
            ["یزد-اردکان", "8951"]
        ]
    }
    else if (index == 23) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["ابوموسی", "79591"],
            ["بستک", "7961"],
            ["بندر عباس", "791"],
            ["بندرجاسک", "79791"],
            ["بندرلنگه", "7971"],
            ["پارسیان", "79771"],
            ["خمیر", "7931"],
            ["رودان - دهبارز", "7991"],
            ["سیریک", "79461"],
            ["قشم", "7951"],
            ["قشم - درگهان", "79531"],
            ["کیش", "7941"],
            ["میناب", "7981"],
            ["هرمزگان - حاجی آباد", "79391"]
        ]
    }
    else if (index == 12) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["ابهر", "4561"],
            ["ایجرود - زرین آباد", "4531"],
            ["خدابنده - قیدار", "4581"],
            ["خرمدره", "4571"],
            ["زنجان", "451"],
            ["سلطانیه", "4551"],
            ["طارم - آب بر", "4591"],
            ["ماهنشان", "4541"]
        ]
    }
    else if (index == 15) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اردبیل", "561"],
            ["اردبیل - هیر", "56461"],
            ["اردبیل- نیر", "5641"],
            ["بیله سوار", "5671"],
            ["پارس آباد", "5691"],
            ["پارس آباد - اصلاندوز", "56981"],
            ["خلخال", "5681"],
            ["سرعین", "56391"],
            ["کوثر - گیوی", "56851"],
            ["گرمی ", "5651"],
            ["مشگین شهر", "5661"],
            ["نمین", "5631"]
        ]
    }
    else if (index == 24) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اردل", "8881"],
            ["بروجن", "8871"],
            ["بروجن - بلداجی", "88761"],
            ["بن", "88581"],
            ["چهارمحال و بختیاری- سامان", "8851"],
            ["شهرکرد", "881"],
            ["شهرکرد - فرخ شهر", "8831"],
            ["شهرکرد - هفشجان", "8841"],
            ["فارسان", "8861"],
            ["کوهرنگ - چلگرد", "88651"],
            ["لردگان", "8891"]
        ]
    }
    else if (index == 20) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["ازنا", "6871"],
            ["الیگودرز", "6861"],
            ["بروجرد", "691"],
            ["پلدختر", "6851"],
            ["پلدختر - معمولان", "68571"],
            ["خرم آباد", "681"],
            ["دلفان - نورآباد", "6831"],
            ["دورود", "6881"],
            ["سلسله - الشتر", "6891"],
            ["کوهدشت", "6841"]
        ]
    }
    else if (index == 17) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اسدآباد", "6541"],
            ["بهار", "6531"],
            ["بهار - لالجین", "65331"],
            ["تویسرکان", "6581"],
            ["رزن", "65681"],
            ["فامنین", "6561"],
            ["کبودرآهنگ", "6551"],
            ["ملایر", "6571"],
            ["نهاوند", "6591"],
            ["همدان", "651"],
            ["همدان-بهار - صالح آباد", "65361"]
        ]
    }
    else if (index == 29) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اسفراین", "9661"],
            ["بجنورد", "941"],
            ["جاجرم", "9441"],
            ["شیروان", "9461"],
            ["فاروج", "9481"],
            ["مانه و سملقان - آشخانه", "9451"]
        ]
    }
    else if (index == 19) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اسلام آبادغرب", "6761"],
            ["پاوه", "6791"],
            ["جوانرود", "67981"],
            ["دالاهو - کرندغرب", "67661"],
            ["روانسر", "67961"],
            ["سرپل ذهاب", "6771"],
            ["سنقر", "6751"],
            ["صحنه", "67461"],
            ["قصرشیرین", "6781"],
            ["قصرشیرین - خسروی", "67841"],
            ["کرمانشاه", "671"],
            ["کرمانشاه-کنگاور", "6741"],
            ["گیلانغرب", "67871"],
            ["گیلانغرب - سرمست", "67791"],
            ["هرسین", "6731"]
        ]
    }
    else if (index == 1) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اسلامشهر", "331"],
            ["اسلامشهر - چهاردانگه", "33191"],
            ["بهارستان - گلستان", "37571"],
            ["بهارستان - نسیم شهر", "37651"],
            ["پاکدشت", "3391"],
            ["پاکدشت - شریف آباد", "33941"],
            ["پردیس", "16581"],
            ["پردیس - بومهن", "16551"],
            ["پیشوا", "3381"],
            ["تهران", "1"],
            ["دماوند", "3971"],
            ["دماوند - آبسرد", "39761"],
            ["دماوند - آبعلی", "39741"],
            ["دماوند - رودهن", "39731"],
            ["دماوند - کیلان", "39751"],
            ["رباط کریم", "3761"],
            ["رباطکریم - پرند", "37611"],
            ["رباطکریم - نصیرآباد", "37551"],
            ["ری", "1813"],
            ["شمیرانات - فشم", "33451"],
            ["شمیرانات - لواسان", "3341"],
            ["شهریار", "3351"],
            ["شهریار - اندیشه", "31686"],
            ["شهریار - شاهدشهر", "33561"],
            ["شهریار - وحیدیه", "33581"],
            ["فیروزکوه", "3981"],
            ["فیروزکوه - ارجمند", "39851"],
            ["قدس", "3751"],
            ["قرچک", "18686"],
            ["ملارد", "31691"],
            ["ملارد - صفادشت", "31641"],
            ["ملارد - کهریزک", "18161"],
            ["ورامین", "3371"]
        ]
    }
    else if (index == 31) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["اشتهارد", "31871"],
            ["ساوجبلاغ - چهارباغ", "33661"],
            ["ساوجبلاغ - کوهسار", "33651"],
            ["ساوجبلاغ - هشتگرد", "3361"],
            ["طالقان", "33691"],
            ["کرج", "31"],
            ["کرج - آسارا", "31551"],
            ["کرج - مهرشهر", "31836"],
            ["نظرآباد", "3331"],
            ["نظرآباد - تنکمان", "33351"]
        ]
    }
    else if (index == 22) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["انار", "7741"],
            ["بافت", "7851"],
            ["بردسیر", "7841"],
            ["بم", "7661"],
            ["جیرفت", "7861"],
            ["راور", "7651"],
            ["رفسنجان", "771"],
            ["رفسنجان - بهرمان", "77461"],
            ["رفسنجان - سرچشمه", "7731"],
            ["زرند", "7761"],
            ["سیرجان", "781"],
            ["شهربابک", "7751"],
            ["عنبرآباد", "7871"],
            ["قلعه گنج", "78841"],
            ["کرمان", "761"],
            ["کرمان - رودبار", "78831"],
            ["کوهبنان", "7781"],
            ["کهنوج", "7881"]
        ]
    }
    else if (index == 26) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["ایرانشهر", "991"],
            ["چابهار", "9971"],
            ["خاش", "9891"],
            ["دلگان - گلمورتی", "99471"],
            ["زابل", "9861"],
            ["زاهدان", "981"],
            ["زهک", "9871"],
            ["سرباز", "9931"],
            ["سیب سوران - سوران", "9961"],
            ["سیستان و بلوچستان-سراوان", "9951"],
            ["کنارک", "9981"],
            ["میرجاوه", "9841"],
            ["نیکشهر", "9991"],
            ["نیکشهر - فنوج", "99461"]
        ]
    }
    else if (index == 7) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["باخرز", "95971"],
            ["بجستان", "96981"],
            ["بجستان - جزین", "96991"],
            ["بردسکن", "9681"],
            ["بینالود - شاندیز", "93561"],
            ["بینالود - طرقبه", "9351"],
            ["تایباد", "9591"],
            ["تایباد - کاریز", "95931"],
            ["تربت جام", "9571"],
            ["تربت جام - صالح آباد", "9581"],
            ["تربت حیدریه", "951"],
            ["تربت حیدریه - اسداباد", "95581"],
            ["تربت حیدریه - کدکن", "9551"],
            ["جغتای", "9641"],
            ["جوین - نقاب", "96471"],
            ["چناران", "9361"],
            ["چناران - گلبهار", "93651"],
            ["چناران - گلمکان", "93691"],
            ["خلیل آباد", "96771"],
            ["خواف", "9561"],
            ["خواف - چمن اباد", "95671"],
            ["داورزن", "9631"],
            ["درگز", "9491"],
            ["رشتخوار", "9541"],
            ["زاوه - دولت آباد", "95491"],
            ["سبزوار", "961"],
            ["سرخس", "9381"],
            ["فریمان", "9391"],
            ["قوچان", "9471"],
            ["قوچان - باجگیران", "94861"],
            ["کاشمر", "9671"],
            ["کلات", "9371"],
            ["گناباد", "9691"],
            ["گناباد - بیدخت", "96941"],
            ["گناباد - کاخک", "96961"],
            ["مشهد", "91"],
            ["مشهد - رضویه", "91671"],
            ["مشهد - طوس سفلی", "93571"],
            ["مشهد - میامی", "93741"],
            ["مه ولات - شادمهر", "95371"],
            ["مه ولات - فیض آباد", "9531"],
            ["مه ولات - مهنه", "95351"],
            ["نیشابور", "931"],
            ["نیشابور - چکنه ", "93361"],
            ["نیشابور - خرو", "93451"],
            ["نیشابور - درود", "9341"]
        ]
    }
    else if (index == 18) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["بانه", "6691"],
            ["بیجار", "6651"],
            ["دهگلان", "66671"],
            ["دیواندره", "6641"],
            ["سروآباد", "66781"],
            ["سقز", "6681"],
            ["سنندج", "661"],
            ["قروه", "6661"],
            ["کامیاران", "6631"],
            ["مریوان", "6671"]
        ]
    }
    else if (index == 30) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["بشرویه", "9781"],
            ["بیرجند", "971"],
            ["خراسان جنوبی-زیرکوه - حاجی آباد", "97671"],
            ["خراسان جنوبی-سربیشه", "9741"],
            ["درمیان - اسدیه", "97441"],
            ["سرایان", "97771"],
            ["طبس", "9791"],
            ["فردوس", "9771"],
            ["قائنات - خضری دشت بیاض", "97661"],
            ["قائنات - قاین", "9761"],
            ["نهبندان", "9751"]
        ]
    }
    else if (index == 21) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["بوشهر", "751"],
            ["بوشهر - خارک", "75461"],
            ["تنگستان - اهرم", "7551"],
            ["تنگستان - دلوار", "75471"],
            ["جم", "75581"],
            ["دشتستان - آبپخش", "75651"],
            ["دشتستان - برازجان", "7561"],
            ["دشتی - خورموج", "7541"],
            ["دیر - بندردیر", "75541"],
            ["دیلم - بندر دیلم", "75361"],
            ["عسلویه", "75391"],
            ["کنگان - بندرکنگان", "75571"],
            ["گناوه - بندرگناوه", "7531"]
        ]
    }
    else if (index == 28) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["بهمئی - لیکک", "75751"],
            ["دنا - سی سخت", "75991"],
            ["کهگیلویه - دهدشت", "7571"],
            ["گچساران - دوگنبدان", "7581"],
            ["یاسوج", "7591"]
        ]
    }
    else if (index == 9) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["دامغان", "3671"],
            ["سرخه", "3551"],
            ["سمنان", "351"],
            ["شاهرود", "361"],
            ["شاهرود - بسطام", "3641"],
            ["گرمسار", "3581"],
            ["گرمسار - ایوانکی", "3591"],
            ["مهدیشهر", "3561"],
            ["مهدیشهر - شهمیرزاد", "3571"]
        ]
    }
    else if (index == 10) {
        cityOptions = [
            ["-- شهر را انتخاب کنید --", "-1"],
            ["قم", "371"],
            ["قم - جعفریه", "37441"],
            ["قم - سلفچگان", "37461"],
            ["قم - قمرود", "37341"],
            ["قم-دستجرد", "3741"],
            ["کهک - قم", "37351"]
        ]
    }
    for (index = 0; index < cityOptions.length; index++) {
        selectCity.options.add(new Option(cityOptions[index][0], cityOptions[index][1]));
    }
    if (selectCity.options[0] != undefined) {
        selectCity.options[0].selected = true;
    }
}

$(document).ready(function () {
    var selectState = document.getElementById("id_state");
    if (selectState.value != 0) cityList(selectState.value);
});